In [10]:
import pandas as pd

df = pd.DataFrame({'key':['A','B','C','A','B','C','A','B','C','A'],
                  'data':[0,5,10,5,10,15,10,15,20,10]})
df

   data key
0     0   A
1     5   B
2    10   C
3     5   A
4    10   B
5    15   C
6    10   A
7    15   B
8    20   C
9    10   A

計算滿足條件的有幾項

In [11]:
for key in ['A','B','C']:
    #print(key,df[df['key'] == key].sum())
    print((df['key']==key).sum())

4
3
3

In [12]:
df.groupby('key').sum()

     data
key
A      25
B      30
C      45

In [13]:
import numpy as np
df.groupby('key').aggregate(np.mean)

      data
key
A     6.25
B    10.00
C    15.00

In [14]:
df.groupby('key').mean()

      data
key
A     6.25
B    10.00
C    15.00

In [15]:
df = pd.read_csv('./data/titanic.csv')
df.head()
#df.set_index('Name')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

取出

下方jim1已經變成一個dictionary

In [16]:
jim = df.groupby('Sex')
jim1 = jim.groups
print(jim1)
print('-------------------------------------------------------')
print(jim1['female'])
print(jim1['male'])

{'female': Int64Index([  1,   2,   3,   8,   9,  10,  11,  14,  15,  18,
            ...
            866, 871, 874, 875, 879, 880, 882, 885, 887, 888],
           dtype='int64', length=314), 'male': Int64Index([  0,   4,   5,   6,   7,  12,  13,  16,  17,  20,
            ...
            873, 876, 877, 878, 881, 883, 884, 886, 889, 890],
           dtype='int64', length=577)}
-------------------------------------------------------
Int64Index([  1,   2,   3,   8,   9,  10,  11,  14,  15,  18,
            ...
            866, 871, 874, 875, 879, 880, 882, 885, 887, 888],
           dtype='int64', length=314)
Int64Index([  0,   4,   5,   6,   7,  12,  13,  16,  17,  20,
            ...
            873, 876, 877, 878, 881, 883, 884, 886, 889, 890],
           dtype='int64', length=577)

**<font color = blue size=5>選取該dictionary內的前3項 並用iloc印出來<font>**

In [17]:
for i in jim1['male'][:3] :
    print(df.iloc[i])

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object
PassengerId                           5
Survived                              0
Pclass                                3
Name           Allen, Mr. William Henry
Sex                                male
Age                                  35
SibSp                                 0
Parch                                 0
Ticket                           373450
Fare                               8.05
Cabin                               NaN
Embarked                              S
Name: 4, dtype: object
PassengerId                   6
Survived                      0
Pclass                        3
Name           Moran, Mr. James
Sex                        male
Age                         NaN
SibSp                         0
Parch                         0
Ticket                   330877
Fare                     8.4583
Cabin                       NaN
Embarked                      Q
Name: 5, dtype: object

**<font color = blue size=5>搭配groupby後方的為中括號<font>**

In [18]:
df.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [19]:
df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

**<font color = blue size = 5>如何找到male 與 female的斷點</font>**